### Task 6-1 Pandas and the Database

In this task we read all major league baseball salaries since 1985 and determine the maximum salary (as well as player who earned it and the year played).

In [1]:
import pandas as pd
import sqlite3

df = None
db_file = '../batting.db'

We'll connect to the database using sqlite3 (module imported above) whose filename is called 'batting.db'.

In [2]:
conn = None
try:
    with sqlite3.connect(db_file) as conn:
        salaries = pd.read_sql('SELECT playerid, salary, year FROM salaries', conn)
        players  = pd.read_sql('SELECT playerid, firstname, lastname FROM players', conn)
finally:
    if conn:
        print('Connection closed!')
        conn.close()

Connection closed!

In [3]:
print(salaries.shape)
salaries.head()

(25575, 3)

    playerid  salary  year
0  barkele01  870000  1985
1  bedrost01  550000  1985
2  benedbr01  545000  1985
3   campri01  633333  1985
4  ceronri01  625000  1985

In [4]:
print(players.shape)
players.head()

(18847, 3)

    playerid  firstname  lastname
0   playerID  nameFirst  nameLast
1  aardsda01      David   Aardsma
2  aaronha01       Hank     Aaron
3  aaronto01     Tommie     Aaron
4   aasedo01        Don      Aase

In [5]:
idx = salaries.salary.idxmax()
playerid = salaries.playerid[idx]
salary = salaries.salary[idx]
year = salaries.year[idx]

In [6]:
highest_paid = players.loc[players.playerid == playerid, ['firstname', 'lastname']]
highest_paid

      firstname   lastname
14472      Alex  Rodriguez

In [7]:
name = highest_paid.values.squeeze()
name

array(['Alex', 'Rodriguez'], dtype=object)

In [8]:
'{0} {1} made ${2:,} in {3}'.format(name[0], name[1], salary, year)

'Alex Rodriguez made $33,000,000 in 2009'